In [1]:
import numpy as np
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
patients= pd.read_csv('C:\\Users\\sanja\\Downloads\\patients.csv')

In [7]:
treatment = pd.read_csv('C:\\Users\\sanja\\Downloads\\treatments.csv')

In [8]:
treatment_cut= pd.read_csv('C:\\Users\\sanja\\Downloads\\treatments_cut.csv')

In [9]:
adverse_reactions = pd.read_csv('C:\\Users\\sanja\\Downloads\\adverse_reactions.csv')

In [4]:
patients.sample(5)

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
203,204,female,Mùi,Lương,1778 Rodney Street,Harvester,MO,63301.0,United States,636-442-6946LuongHongMui@einrot.com,2/29/1956,192.7,60,37.6
292,293,male,Fraser,Hunter,3072 Braxton Street,Cissna Park,Illinois,60924.0,United States,FraserHunter@teleworm.us815-457-5970,7/9/1929,143.0,64,24.5
76,77,female,Maryam,Dratchev,3314 Rocket Drive,Minneapolis,MN,55410.0,United States,612-925-3123MaryamDratchev@superrito.com,1/15/1983,190.1,63,33.7
160,161,male,Flaviano,Endrizzi,3209 Crowfield Road,Phoenix,AZ,85023.0,United States,FlavianoEndrizzi@cuvox.de602-993-7880,10/11/1928,195.1,75,24.4
363,364,female,Elisabetta,Lorenzo,1014 Locust Court,Los Angeles,California,90017.0,United States,562-452-5685ElisabettaLorenzo@gustr.com,7/16/1927,124.7,61,23.6

In [5]:
patients.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 503 entries, 0 to 502
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   patient_id    503 non-null    int64
 1   assigned_sex  503 non-null    object
 2   given_name    503 non-null    object
 3   surname       503 non-null    object
 4   address       491 non-null    object
 5   city          491 non-null    object
 6   state         491 non-null    object
 7   zip_code      491 non-null    float64
 8   country       491 non-null    object
 9   contact       491 non-null    object
 10  birthdate     503 non-null    object
 11  weight        503 non-null    float64
 12  height        503 non-null    int64
 13  bmi           503 non-null    float64
dtypes: float64(3), int64(2), object(9)
memory usage: 55.1+ KB

In [11]:
treatment.sample(2)

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
184,chân,bùi,31u - 42u,-,7.53,7.18,0.35
209,kári,hervinsson,37u - 43u,-,8.09,7.66,NaN

In [12]:
treatment.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 280 entries, 0 to 279
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   given_name    280 non-null    object
 1   surname       280 non-null    object
 2   auralin       280 non-null    object
 3   novodra       280 non-null    object
 4   hba1c_start   280 non-null    float64
 5   hba1c_end     280 non-null    float64
 6   hba1c_change  171 non-null    float64
dtypes: float64(3), object(4)
memory usage: 15.4+ KB

In [13]:
treatment_cut.sample(2)

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
45,štefanija,novosel,37u - 42u,-,7.64,7.17,NaN
46,anja,mueller,43u - 56u,-,7.58,7.29,0.29

In [14]:
treatment_cut.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   given_name    70 non-null     object
 1   surname       70 non-null     object
 2   auralin       70 non-null     object
 3   novodra       70 non-null     object
 4   hba1c_start   70 non-null     float64
 5   hba1c_end     70 non-null     float64
 6   hba1c_change  42 non-null     float64
dtypes: float64(3), object(4)
memory usage: 4.0+ KB

In [15]:
adverse_reactions.sample(2)

   given_name   surname adverse_reaction
29       alex  crawford     hypoglycemia
33  krisztina    magyar     hypoglycemia

In [16]:
adverse_reactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   given_name        34 non-null     object
 1   surname           34 non-null     object
 2   adverse_reaction  34 non-null     object
dtypes: object(3)
memory usage: 944.0+ bytes

In [17]:
patients.duplicated().sum()

0

In [18]:
patients['patient_id'].duplicated().sum()

0

In [19]:
patients.duplicated(subset=['given_name','surname']).sum()

5

In [20]:
patients[patients.duplicated(subset=['given_name','surname'])]

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
229,230,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
237,238,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
244,245,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
251,252,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4
277,278,male,John,Doe,123 Main Street,New York,NY,12345.0,United States,johndoe@email.com1234567890,1/1/1975,180.0,72,24.4

In [22]:
treatment.duplicated().sum()

1

In [25]:
treatment[treatment.duplicated()]

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
136,joseph,day,29u - 36u,-,7.7,7.19,NaN

In [27]:
treatment[treatment.duplicated(subset=['given_name','surname'])]

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
136,joseph,day,29u - 36u,-,7.7,7.19,NaN

In [28]:
treatment_cut[treatment_cut.duplicated(subset=['given_name','surname'])]

Empty DataFrame
Columns: [given_name, surname, auralin, novodra, hba1c_start, hba1c_end, hba1c_change]
Index: []

In [29]:
adverse_reactions.duplicated().sum()

0

In [30]:
patients.describe()

       patient_id      zip_code      weight      height         bmi
count  503.000000    491.000000  503.000000  503.000000  503.000000
mean   252.000000  49084.118126  173.434990   66.634195   27.483897
std    145.347859  30265.807442   33.916741    4.411297    5.276438
min      1.000000   1002.000000   48.800000   27.000000   17.100000
25%    126.500000  21920.500000  149.300000   63.000000   23.300000
50%    252.000000  48057.000000  175.300000   67.000000   27.200000
75%    377.500000  75679.000000  199.500000   70.000000   31.750000
max    503.000000  99701.000000  255.900000   79.000000   37.700000